#define _CRT_SECURE_NO_WARNINGS


#include<string.h>
#include<stdio.h>

void main(void) {

	/*１の変数を定義します。*/
	char ss1[11] = { 0 };
	char ss2[15] = { 0 };

	char s1[11] = { 0 };
	char s2[15] = { 0 };

	/*２の変数を定義します。*/
	char ss3[128] = { 0 };
	int i=0;

	/*１のプログラム*/

	s1[0] = 0x30;		/*文字０を代入*/
	s1[1] = 0x31;		/*文字１を代入*/
	s1[2] = 0x32;		/*文字２を代入*/
	s1[3] = 0x33;		/*文字３を代入*/
	s1[4] = 0x34;		/*文字４を代入*/
	s1[5] = 0x35;		/*文字５を代入*/
	s1[6] = 0x36;		/*文字６を代入*/
	s1[7] = 0x37;		/*文字７を代入*/
	s1[8] = 0x38;		/*文字８を代入*/
	s1[9] = 0x39;		/*文字９を代入*/
	s1[10] = '\0';		/*終端*/

	s2[0] = 0x61;		/*文字aを代入*/
	s2[1] = 0x62;		/*文字bを代入*/
	s2[2] = 0x63;		/*文字cを代入*/
	s2[3] = 0x64;		/*文字dを代入*/
	s2[4] = 0x65;		/*文字eを代入*/
	s2[5] = 0x66;		/*文字fを代入*/
	s2[6] = 0x67;		/*文字gを代入*/
	s2[7] = 0x68;		/*文字hを代入*/
	s2[8] = 0x69;		/*文字iを代入*/
	s2[9] = 0x6a;		/*文字jを代入*/
	s2[10] = 0x6b;		/*文字kを代入*/
	s2[11] = 0x6c;		/*文字lを代入*/
	s2[12] = 0x6d;		/*文字mを代入*/
	s2[13] = 0x6e;		/*文字nを代入*/
	s2[14] = '\0';		/*終端*/

	memcpy(&(ss1[0]), &(s1[0]), 11);
	strcpy(&(ss2[0]), &(s2[0]));


	/*２のプログラム*/

	i = 10;

	sprintf(&(ss3[0]), "変数の値は%d", i);
	
	return;
}